In [1]:
import numpy as np 
import pandas as pd  
import warnings 
warnings.filterwarnings('ignore')

In [3]:
date_Df = pd.read_csv('orders.csv')
dateTime_Df = pd.read_csv('messages.csv')

In [4]:
date_Df.sample(5)

           date  product_id  city_id  orders
298  2018-12-12        3748       17      11
934  2019-02-08        1973       16       1
600  2019-10-18        3464        0       2
362  2019-10-10        3734        4      25
72   2018-08-27        7582       17      30

In [6]:
dateTime_Df.sample(5)

                    date                                                msg
682  2013-01-14 00:06:00  Ищу девушку которая ценит отношения П23 Днепр ...
807  2015-05-08 01:26:00  познакомлюсь с девушкой для сер отношений.0661...
84   2016-08-30 23:29:00     Д познакометься с парном для дружбе 0931447415
291  2013-05-21 00:46:00     БОЛЬШОЙ РАЗМЕР ДЛЯ ДЕВУШКИ  СЕЙЧАС! 0505546534
15   2012-08-24 23:13:00  Саша 4 Я знаю все о твоих письмах.Сколько это ...

# Starting with date_Df

In [7]:
date_Df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [8]:
date_Df['date'] = pd.to_datetime(date_Df['date'])  # This converts date column's type from object to DateTime

In [9]:
date_Df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [14]:
date_Df['order_year'] = date_Df['date'].dt.year
date_Df['order_month'] = date_Df['date'].dt.month
date_Df['month_name'] = date_Df['date'].dt.month_name()

In [15]:
date_Df.head()

        date  product_id  city_id  orders  order_year  order_month month_name
0 2019-12-10        5628       25       3        2019           12   December
1 2018-08-15        3646       14     157        2018            8     August
2 2018-10-23        1859       25       1        2018           10    October
3 2019-08-17        7292       25       1        2019            8     August
4 2019-01-06        4344       25       3        2019            1    January

In [30]:
date_Df['day'] = date_Df['date'].dt.day 
date_Df['day_of_week'] = date_Df['date'].dt.dayofweek
date_Df['day_name'] = date_Df['date'].dt.day_name()
date_Df['week_of_year'] = date_Df['date'].dt.isocalendar().week

In [31]:
date_Df.head(5)

,date,product_id,city_id,orders,order_year,order_month,month_name,day_of_week,day,day_name,week_of_year
0,2019-12-10,5628,25,3,2019,12,December,1,10,Tuesday,50
1,2018-08-15,3646,14,157,2018,8,August,2,15,Wednesday,33
2,2018-10-23,1859,25,1,2018,10,October,1,23,Tuesday,43
3,2019-08-17,7292,25,1,2019,8,August,5,17,Saturday,33
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [32]:
import datetime

In [36]:
today = datetime.datetime.today()
today

datetime.datetime(2025, 10, 19, 15, 4, 1, 417712)

In [37]:
today-date_Df['date']

0     2140 days 15:04:01.417712
1     2622 days 15:04:01.417712
2     2553 days 15:04:01.417712
3     2255 days 15:04:01.417712
4     2478 days 15:04:01.417712
                 ...
995   2568 days 15:04:01.417712
996   2509 days 15:04:01.417712
997   2357 days 15:04:01.417712
998   2422 days 15:04:01.417712
999   2196 days 15:04:01.417712
Name: date, Length: 1000, dtype: timedelta64[ns]

In [39]:
(today-date_Df['date']).dt.days

0      2140
1      2622
2      2553
3      2255
4      2478
       ...
995    2568
996    2509
997    2357
998    2422
999    2196
Name: date, Length: 1000, dtype: int64

# Now dealing with date_Df

In [44]:
dateTime_Df['date'] = pd.to_datetime(dateTime_Df['date'])

In [46]:
dateTime_Df['hour'] = dateTime_Df['date'].dt.hour
dateTime_Df['min'] = dateTime_Df['date'].dt.minute
dateTime_Df['sec'] = dateTime_Df['date'].dt.second
dateTime_Df.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [51]:
dateTime_Df['time'] = dateTime_Df['date'].dt.time
dateTime_Df['only_date'] = dateTime_Df['date'].dt.date 
dateTime_Df.head()

,date,msg,hour,min,sec,time,only_date
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00,2013-12-15
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00,2014-04-29
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00,2012-12-30
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00,2014-11-28
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00,2013-10-26

In [67]:
(today-dateTime_Df['date'])/np.timedelta64(10,'h')

0      10383.823373
1      10057.540039
2      11223.871706
3       9548.655039
4      10501.588373
           ...
995    11917.423373
996    10287.983373
997    11403.945039
998    11682.350039
999     9935.165039
Name: date, Length: 1000, dtype: float64